/******************************************************************************
*
*  Copyright (C),2007, Fuzhou Rockchip Co.,Ltd.
*
*  File name :     rk_eq.c
*  Description:
*  Remark:
*
*  History:
*           <author>      <time>     <version>       <desc>
*           Huweiguo     06/12/29      1.0
*           HuWeiGuo     07/09/27      2.0          修改了接口函数
*
*******************************************************************************/

/*
 TODO:
 1. 将几个表格放到FLASH里，仅在初始化EQ读系数时使用
 2. 相应修改ROCKEQ_Get_Coeff()函数
*/
//#include "SysConfig.h"
#include "audio_main.h"
#include "effect.h"
#ifdef  _RK_EQ_5_
#define     _ATTR_RKEQ_TEXT_          __attribute__((section("RkEqCode")))
#define     _ATTR_RKEQ_DATA_          __attribute__((section("RkEqData")))
#define     _ATTR_RKEQ_BSS_           __attribute__((section("RkEqBss"),zero_init))

#include "AudioControl.h"
extern AudioInOut_Type	   AudioIOBuf;


/*
 * If SUPPORT_HIGH_PRECISION = 1, we support high precison, in other words, has no precision lose,
 * If SUPPORT_HIGH_PRECISION = 0, we lose some precison, but it is much quicker.　
 */
#define SUPPORT_HIGH_PRECISION 1
//#include "typedef.h"
//#include "ModuleInfoTab.h"
/*
 *  Struct
 */


typedef struct
{                               // address      bytes
    long  temp_mem;             // 0x00          4    no
    long  i_32buff[20];         // 0x04          4*20
    long  i_32sclaedX;          // 0x54          4    no
    long  PassBandDetect;       // 0x58          4
    long  After_Scale;          // 0x5C          4  标志factored_B是否超过13bit
    short _a[10];               // 0x60          2*10
    short _b[10];               // 0x74          2*10
    short factored_B;           // 0x88          2
    short EQ_ps_factor;         // 0x8A          2

    // 加密控制参数, 为1 才能正确处理，其它会产生错误
    short fReal;

} IIRFilterState;

typedef struct
{
    short x[8] ;
    long long y[8] ;
    int _a[4];
    int _b[6];

    // 加密控制参数, 为1 才能正确处理，其它会产生错误

} IIRFilterState_BASS;


_ATTR_RKEQ_BSS_
unsigned short B_factor;// = 0;
//_ATTR_RKEQ_BSS_
 IIRFilterState g_FilterState;
 IIRFilterState_BASS g_bass_FilterState;
 int EQ_Last_maxGain = 0;
typedef struct
{
    short a1;
    short a2;
    short b1;
    short b2;
    short B;
}eqCoef_t;

typedef struct
{
    int a1;
    int a2;
    int b1;
    int b2;
    int B;
}bassCoef_t;

typedef struct
{
    short eqArray[5*5*25*5+1];
    int   bass_60_tbl[6*5*5];
    int   bass_120_tbl[150];
} eq_table_t;

_ATTR_RKEQ_DATA_
eq_table_t Eq_Table =
{
//_ATTR_RKEQ_DATA_
//short eqArray[]=
    {
        //采样 0
//采样 0频段 0
        0x3d01,0xffffe2e5,0xffffc0db,0x1f3f,0x1eea,
